Revit 2027 API
DefinitionBindingMapIterator Class
An iterator to a parameter definition to parameter bindings map.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionBindingMapIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class DefinitionBindingMapIterator : APIObject,
	IEnumerator
Public MustInherit Class DefinitionBindingMapIterator
	Inherits APIObject
	Implements IEnumerator
public ref class DefinitionBindingMapIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type DefinitionBindingMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The DefinitionBindingMapIterator type exposes the following members.
Constructors
Name | Description
DefinitionBindingMapIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the binding that is the current focus of the iterator.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Key | Retrieves the definition that is the current focus of the iterator.
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace